IDEA Open Model
ConcreteSLSCheckResultCrackWidthEc2 Properties
Compatible with IDEA StatiCa v 10.1
The ConcreteSLSCheckResultCrackWidthEc2 type exposes the following members.
Properties
Name | Description
Check
 settings of check type
 (Inherited from ConcreteCheckResultBase.)
CheckValue
 calculated limited value, calculated as strain to limit strain
 (Inherited from ConcreteCheckResultBase.)
InternalFores
 internal forces used for calculation
 (Inherited from ConcreteCheckResultBase.)
LimitCheckValue
 limit check value for result check
 (Inherited from ConcreteCheckResultBase.)
My
 Bending moment around y axis for quasi-permanent combination
Mz
 Bending moment around z axis for quasi-permanent combination
N
 Normal force for quasi-permanent combination
NonConformities
 Returns nonconformity in section
 (Inherited from ConcreteCheckResultBase.)
Result
 check result passed/failed
 (Inherited from ConcreteCheckResultBase.)
W
 calculated crack width value
Wlim
 limiting crack width value
Top
See Also
Reference
ConcreteSLSCheckResultCrackWidthEc2 Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace